Repository: robo8590/signup
Catalog: SignUpSample/Resource/*.lproj/Localizable.strings
Languages: vi

# SignUpView.Title
source: Profile Creation
vi: Tạo tài khoản

# SignUpView.Instruction
source: Use the form below to submit your portfolio. An email and password are required.
vi: Sử dụng biểu mẫu dưới đây để tạo hồ sơ của bạn. Thư điện tử và mật khẩu là trường bắt buộc.

# SignUpView.FirstNameTextField.Title
source: First Name
vi: Tên

# SignUpView.EmailTextField.Title
source: Email
vi: Thư điện tử

# SignUpView.PasswordField.Title
source: Password
vi: Mật khẩu

# SignUpView.WebsiteField.Title
source: Website
vi: Trang web

# SignUpView.TermOfUse.Title
source: Term Of Use
vi: Điều khoản sử dụng

# SignUpView.NextButton.Title
source: Next
vi: Tiếp

# SignUpView.SubmitButton.Title
source: Submit
vi: Gửi đăng ký

# SignUpView.EmailIsInvalid
source: The email is invalid.
vi: Thư điện tử của bạn không hợp lệ.

# SignUpView.PasswordIsInvalid
source: The password must have 6 to 200 characters, 1 lowercase, 1 uppercase and 1 special character.
vi: Mật khẩu cần có 6 đến 200 ký tự, 1 ký tự in thường, 1 ký tự in hoa và 1 ký tự đặc biệt.

# SignUpView.WebsiteIsInvalid
source: The website is invalid.
vi: Đường dẫn trang web không hợp lệ.

# SignUpView.EmailIsAlreadyInUse
source: The email is already in use.
vi: Thư điện tử đã được sử dụng.

# SignUpView.UnknownError
source: Please try it later. The system couldn't create profile this time.
vi: Hãy thử lại sau. Hệ thống đang không thể tạo tài khoản lúc này.

# SignUpView.TermOfUse
source: MIT License Copyright (c) 2021 Nam Tran Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
vi: Giấy phép MIT Bản quyền năm 2021 Nam Tran Quyền theo đây được cấp miễn phí cho bất kỳ người nào có được bản sao của phần mềm này và các tệp tài liệu liên quan ("Phần mềm"), để sử dụng mà không có giới hạn, bao gồm không giới hạn các quyền để sử dụng, sao chép, sửa đổi, hợp nhất, xuất bản, phân phối, cấp phép phụ và/hoặc bán các bản sao của Phần mềm và để cho phép những người có Phần mềm được làm như vậy cần tuân theo các điều kiện sau: Thông báo bản quyền ở trên và thông báo cho phép này sẽ được bao gồm trong tất cả bản sao hoặc các phần quan trọng của Phần mềm. PHẦN MỀM ĐƯỢC CUNG CẤP "NGUYÊN TRẠNG", KHÔNG ĐƯỢC BẢO HÀNH BẤT KỲ HÌNH THỨC NÀO, RÕ RÀNG HOẶC NGỤ Ý, BAO GỒM NHƯNG KHÔNG GIỚI HẠN ĐẢM BẢO VỀ KHẢ NĂNG LAO ĐỘNG, PHÙ HỢP VỚI MỤC ĐÍCH CỤ THỂ VÀ KHÔNG HỢP LỆ. TRONG MỌI TRƯỜNG HỢP SẼ KHÔNG CÓ TÁC GIẢ HOẶC CHỦ BẢN QUYỀN CHỊU TRÁCH NHIỆM VỀ BẤT KỲ KHIẾU NẠI, THIỆT HẠI HOẶC TRÁCH NHIỆM PHÁP LÝ KHÁC NÀO TRONG MỘT HÀNH VI HỢP ĐỒNG, KHAI THÁC HOẶC CÁCH KHÁC, PHÁT SINH TỪ, NGOÀI HOẶC KẾT NỐI VỚI PHẦN MỀM HOẶC VIỆC SỬ DỤNG HOẶC KINH DOANH KHÁC TRONG PHẦN MỀM.

# SignUpConfirmationView.WelcomeLabel %@!
source: Hello, %@!
vi: Xin chào %@!

# SignUpConfirmationView.LoginButton.Title
source: Sign In
vi: Login

# SignUpConfirmationView.MessageLabel
source: Your super-awesome portfolio has been successfully submitted! The details below will be public within your community!
vi: Tài khoản của bạn đã được tạo thành công! Thông tin dưới đây sẽ được hiện thị trên cộng đồng của bạn!
